app/Controllers/Admin/MainPage.php

SELECT `web_menu_id`, `web_title`, concat("http://localhost/cogent-solution/images/menu/", web_image) as web_image, `created_on`, `meta_title`, `meta_desc`, `meta_key`, `is_active`
FROM `web_menu`
WHERE `is_deleted` = 0
AND `web_menu_id` = '3'
ORDER BY `web_menu_id`
---
    public function getMenu()
    {
        if (!session()->get('user_login_id')) {
            return $this->respond([], 'Session Expired', 404);
        }
        $data = $this->db->table('web_menu')
            ->select('web_menu_id,web_title,
            concat("' . MENU_IMG . '",web_image) as web_image,created_on,meta_title,meta_desc,meta_key,is_active')
            ->where('is_deleted', 0);

UPDATE `web_menu` SET `web_title` = 'Home', `meta_title` = 'Home Page', `meta_desc` = 'Home page', `meta_key` = 'Home page', `web_image` = 'menu_59841763708338.jpg', `updated_by` = '10391', `updated_on` = '2025-11-21 12:28:58'
WHERE `web_menu_id` = '1'
---
            $updateData['updated_by'] = session()->get('user_login_id');
            $updateData['updated_on'] = date('Y-m-d H:i:s');
            $builder->where('web_menu_id', $data['web_menu_id']);
            if (!$builder->update($updateData)) {

SELECT *
FROM `web_setting`
WHERE `web_setting_id` = 1
---
    public function pageSetting()
    {
        if (!session()->get('user_login_id')) {
            return redirect()->to(base_url(ADMIN_NAME));
        }
        $page['title'] = "Setting";
        $page['data'] = $this->db->table('web_setting')
            ->select('*')
            ->where('web_setting_id', 1)
            ->get()->getRowArray();

SELECT *
FROM `web_content`
WHERE `web_content_id` = 13
SELECT `status`
FROM `web_content`
WHERE `web_content_id` = 20
---
    public function pageBanner()
    {
        if (!session()->get('user_login_id')) {
            return redirect()->to(base_url(ADMIN_NAME));
        }
        $page['data'] = $this->db->table('web_content')
            ->select('*')
            ->where('web_content_id', 13)
            ->get()->getRowArray();
        $page['title'] = "Banner";
            $page['bannermaster'] = $this->db->table('web_content')
                            ->select('status')
                            ->where('web_content_id', 20)->get()->getRowArray();

SELECT `web_banner_id`, concat("http://localhost/cogent-solution/images/banner/", web_image) as web_image, `display_order`, `created_on`, `display_order`, `is_active`
FROM `web_banner`
WHERE `is_deleted` = 0
ORDER BY `web_banner_id`
SELECT count(*) as data_count
FROM `web_banner`
WHERE `is_deleted` = 0
---
    public function getBanner()
    {
        if (!session()->get('user_login_id')) {
            return $this->respond([], 'Session Expired', 404);
        }
        $data = $this->db->table('web_banner')
            ->select('web_banner_id,concat("' . BANNER_IMG . '",web_image) as web_image,display_order,created_on,display_order,is_active')
            ->where('is_deleted', 0);
        if ($this->request->getPost('web_banner_id', NULL)) {
            $data->where('web_banner_id', $this->request->getPost('web_banner_id', NULL));
        }
        $data = $data->orderBy('web_banner_id')
            ->get()->getResultArray();

        foreach ($data as $i => &$row) {
            $row['serial_no'] = $i + 1;
        }

        unset($row);
        $data_count = $this->db->table('web_banner')->select('count(*) as data_count')->where('is_deleted', 0)->get()->getRowArray();

SELECT *
FROM `web_content`
WHERE `web_content_id` = 1
---
    public function swiper()
    {
        if (!session()->get('user_login_id')) {
            return redirect()->to(base_url(ADMIN_NAME));
        }

        $page['data'] = $this->db->table('web_content')
            ->select('*')
            ->where('web_content_id', 1)
            ->get()
            ->getRowArray();

SELECT *, concat("http://localhost/cogent-solution/images/content/", web_image_1) as image
FROM `web_content`
WHERE `web_content_id` = 3
---
    public function pageHomeAbout()
    {
        if (!session()->get('user_login_id')) {
            return redirect()->to(base_url(ADMIN_NAME));
        }

        $page['data'] = $this->db->table('web_content')
            ->select('*,concat("' . CONTENT_IMG . '",web_image_1) as image')
            ->where('web_content_id', 3)
            ->get()->getRowArray();