app/Controllers/Admin/Slides.php

SELECT *
FROM `settings`
---
   public function videoPreview()
{
    $db = \Config\Database::connect();
    $row = $db->table('settings')->get()->getRowArray();