app/Controllers/Home.php

SELECT `about_content`, `user_email`, `user_phone_1`, `map_url`, `address_1`, `address_2`, `address_3`, `pincode`, `facebook_url`, `instagram_url`, `linkedin_url`
FROM `web_setting`
WHERE `web_setting_id` = 1
---
    public function __construct() {
        $this->db = \Config\Database::connect();
        $this->data['setting'] = $this->db->table('web_setting')
                ->select('about_content, user_email, user_phone_1, map_url, address_1, address_2, address_3, pincode, facebook_url, instagram_url, linkedin_url')
                ->where('web_setting_id', 1)
                ->get()
                ->getRowArray();

SELECT `meta_title`, `meta_desc`, `meta_key`
FROM `web_menu`
WHERE `web_menu_id` = 9
SELECT *, CONCAT("http://localhost/cogent-solution/images/banner/", web_image) AS image
FROM `web_banner`
WHERE `is_deleted` = 0
AND `is_active` = 1
ORDER BY `display_order` ASC
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 20
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 1
SELECT *, concat("http://localhost/cogent-solution/images/content/", web_image_1) as web_image
FROM `web_content`
WHERE `web_content_id` = 2
SELECT *, concat("http://localhost/cogent-solution/images/content/", web_image_1) as web_image, `status`
FROM `web_content`
WHERE `web_content_id` = 3
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 4
SELECT `web_podcast_id`, `web_title`, `web_desc`, `web_time`, `web_url`
FROM `web_podcast`
WHERE `is_deleted` = 0
AND `is_active` = 1
ORDER BY `display_order`
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 24
SELECT `web_blog_id`, `web_title`, `web_cate_name`, `web_desc`, `web_time`, `web_url`, concat("http://localhost/cogent-solution/images/blog/", web_image) as web_image
FROM `web_blog`
WHERE `is_deleted` = 0
AND `is_active` = 1
AND `web_title` IS NOT NULL
ORDER BY `display_order`
SELECT `is_active`
FROM `web_menu`
WHERE `web_menu_id` = 7
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 26
SELECT *
FROM `web_content`
WHERE `web_content_id` = 16
SELECT *
FROM `web_content`
WHERE `web_content_id` = 17
SELECT *
FROM `web_content`
WHERE `web_content_id` = 19
SELECT `web_looks_id`, `web_title`, `web_url`, `web_content`, concat("http://localhost/cogent-solution/images/looks/", web_image) as web_image, `display_order`, `created_on`, `display_order`, `is_active`
FROM `web_looks`
WHERE `is_deleted` = 0
AND `is_active` = 1
ORDER BY `display_order` DESC
 LIMIT 3
---
    public function index() {
        $this->data['meta'] = $this->db->table('web_menu')
                        ->select('meta_title,meta_desc,meta_key','is_active')
                        ->where('web_menu_id', 9)->get()->getRowArray();


        $this->data['banner_data'] = $this->db->table('web_banner')
            ->select('*, CONCAT("' . BANNER_IMG . '", web_image) AS image')
            ->where('is_deleted', 0)
            ->where('is_active', 1) // ✅ Only active banners
            ->orderBy('display_order', 'ASC')
            ->get()
            ->getResultArray();


        $this->data['bannermaster'] = $this->db->table('web_content')
                        ->select('web_content_1,web_content_2,status')
                        ->where('web_content_id', 20)->get()->getRowArray();


        $this->data['mission_data'] = $this->db->table('web_content')
                        ->select('web_content_1,web_content_2,status')
                        ->where('web_content_id', 1)->get()->getRowArray();

        $this->data['founder_data'] = $this->db->table('web_content')
                        ->select('*,concat("' . CONTENT_IMG . '",web_image_1) as web_image')
                        ->where('web_content_id', 2)->get()->getRowArray();

        $this->data['about_data'] = $this->db->table('web_content')
                        ->select('*,concat("' . CONTENT_IMG . '",web_image_1) as web_image, status')
                        ->where('web_content_id', 3)->get()->getRowArray();

        $this->data['action_data'] = $this->db->table('web_content')
                        ->select('web_content_1,web_content_2,status')
                        ->where('web_content_id', 4)->get()->getRowArray();

        $this->data['podcast_data'] = $this->db->table('web_podcast')
                        ->select('web_podcast_id, web_title, web_desc, web_time, web_url')
                        ->where('is_deleted', 0)
                        ->where('is_active', 1)
                        ->orderBy('display_order')
                        ->get()->getResultArray();
        $this->data['podcastvideomaster'] = $this->db->table('web_content')
                        ->select('web_content_1,web_content_2,status')
                        ->where('web_content_id', 24)->get()->getRowArray();

        // Fetch blog data
        $this->data['blog_data'] = $this->db->table('web_blog')
                        ->select('web_blog_id, web_title, web_cate_name, web_desc, web_time, web_url, concat("' . BLOG_IMG . '",web_image) as web_image')
                        ->where('is_deleted', 0)
                        ->where('is_active', 1)
                        ->where('web_title IS NOT NULL') // Exclude blogs with NULL titles
                        ->orderBy('display_order')
                        ->get()->getResultArray();

        $this->data['blognavstatus'] = $this->db->table('web_menu')
                        ->select('is_active')
                        ->where('web_menu_id', 7)->get()->getRowArray();
        $this->data['blogdatamaster'] = $this->db->table('web_content')
            ->select('web_content_1,web_content_2,status')
            ->where('web_content_id', 26)->get()->getRowArray();

        $this->data['content3'] = $this->db->table('web_content')
                        ->select('*')
                        ->where('web_content_id', 16)->get()->getRowArray();
        $this->data['content4'] = $this->db->table('web_content')
                        ->select('*')
                        ->where('web_content_id', 17)->get()->getRowArray();

        $this->data['content6'] = $this->db->table('web_content')
                        ->select('*')
                        ->where('web_content_id', 19)->get()->getRowArray();

        $this->data['looks_list'] = $this->db->table('web_looks')
                        ->select('web_looks_id,web_title,web_url,web_content,concat("' . LOOKS_IMG . '",web_image) as web_image,display_order,created_on,display_order,is_active')
                        ->where('is_deleted', 0)
                        ->where('is_active', 1)
                        ->orderBy('display_order', 'desc')
                        ->limit(3)
                        ->get()->getResultArray();

SELECT `web_title`, concat("http://localhost/cogent-solution/images/menu/", web_image) as menu_image, `meta_title`, `meta_desc`, `meta_key`
FROM `web_menu`
WHERE `web_menu_id` = 3
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 12
SELECT concat("http://localhost/cogent-solution/images/gallery/", web_image) as web_image
FROM `web_gallery`
WHERE `is_deleted` = 0
AND `is_active` = 1
ORDER BY `display_order`
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 21
SELECT *
FROM `web_video`
WHERE `is_deleted` = 0
AND `is_active` = 1
ORDER BY `display_order`
SELECT `web_content_1`, `web_content_2`, `status`
FROM `web_content`
WHERE `web_content_id` = 22
---
    public function pageResources() {

       $this->data['meta'] = $this->data['menu'] = $this->db->table('web_menu')
                        ->select('web_title,concat("' . MENU_IMG . '",web_image) as menu_image,meta_title,meta_desc,meta_key')
                        ->where('web_menu_id', 3)->get()->getRowArray();
        $this->data['about_data'] = $this->db->table('web_content')
                        ->select('web_content_1,web_content_2,status')
                        ->where('web_content_id', 12)->get()->getRowArray();

        $this->data['gallery_list'] = $this->db->table('web_gallery')
                        ->select('concat("' . GALLERY_IMG . '",web_image) as web_image')
                        ->where('is_deleted', 0)
                        ->where('is_active', 1)
                        ->orderBy('display_order')
                        ->get()->getResultArray();
        $this->data['gallerymaster'] = $this->db->table('web_content')
                            ->select('web_content_1,web_content_2,status')
                            ->where('web_content_id', 21)->get()->getRowArray();

        $this->data['video_list'] = $this->db->table('web_video')
                        ->select('*')
                        ->where('is_deleted', 0)
                        ->where('is_active', 1)
                        ->orderBy('display_order')
                        ->get()->getResultArray();

        $this->data['videomaster'] = $this->db->table('web_content')
                            ->select('web_content_1,web_content_2,status')
                            ->where('web_content_id', 22)->get()->getRowArray();